Тестовая_база_ERP_14/src/InformationRegisters/ПараметрыПериодовСтажаПФР/ПараметрыПериодовСтажаПФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПериодовСтажаПФР</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСтажаПФР</name>
    <type>
      <types>EnumRef.ВидыСтажаПФР2014</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.УсловияТруда</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаВидСтажаПФР</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Территория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </resources>
  <resources>
    <name>УсловияТруда</name>
    <type>
      <types>CatalogRef.УсловияТруда</types>
    </type>
  </resources>
  <resources>
    <name>ТерриториальныеУсловия</name>
    <type>
      <types>CatalogRef.ТерриториальныеУсловияПФР</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТерриториальныеУсловия</name>
    <type>
      <types>CatalogRef.УдалитьТерриториальныеУсловияПФР</types>
    </type>
  </resources>
  <resources>
    <name>ОсобыеУсловияТруда</name>
    <type>
      <types>CatalogRef.ОсобыеУсловияТрудаПФР</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОсобыеУсловияТруда</name>
    <type>
      <types>CatalogRef.УдалитьОсобыеУсловияТрудаПФР</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеВыслугиЛет</name>
    <type>
      <types>CatalogRef.ОснованияДосрочногоНазначенияПенсии</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОснованиеВыслугиЛет</name>
    <type>
      <types>CatalogRef.УдалитьОснованияДосрочногоНазначенияПенсии</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаОрганизация</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаПодразделение</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаДолжность</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаГрафикРаботы</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаКоличествоСтавок</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаТерритория</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаУсловияТруда</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаТерриториальныеУсловия</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаОсобыеУсловияТруда</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаОснованиеВыслугиЛет</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ВнутреннееСовместительство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаВнутреннееСовместительство</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ТерриториальныеУсловияДополнительные</name>
    <type>
      <types>CatalogRef.ТерриториальныеУсловияПФР</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеРесурсаТерриториальныеУсловияДополнительные</name>
    <type>
      <types>EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</types>
    </type>
  </resources>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоровСЗВ63</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.СостоянияСотрудника</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СторнированиеНачислений</types>
      <types>DocumentRef.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком</types>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.ПростойСотрудников</types>
      <types>DocumentRef.ОтпускБезСохраненияОплатыСписком</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ДоговорАвторскогоЗаказа</types>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ОтгулСписком</types>
      <types>DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</types>
      <types>DocumentRef.НачальнаяШтатнаяРасстановка</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.ПеремещениеВДругоеПодразделение</types>
      <types>DocumentRef.ВосстановлениеВДолжности</types>
      <types>DocumentRef.ТабельУчетаРабочегоВремени</types>
      <types>DocumentRef.ОтпускБезСохраненияОплаты</types>
      <types>DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</types>
      <types>DocumentRef.ПрогулНеявка</types>
      <types>DocumentRef.ДоговорРаботыУслуги</types>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.Командировка</types>
      <types>DocumentRef.УвольнениеСписком</types>
      <types>DocumentRef.Отгул</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
      <types>DocumentRef.ПереносДанных</types>
      <types>DocumentRef.ПеремещениеМеждуТерриториями</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ПараметрыПериодовСтажаПФР/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыПериодовСтажаПФР.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ПараметрыПериодовСтажаПФР.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПараметрыПериодовСтажаПФР.ТипДоговора КАК ТипДоговора,
	|	ПараметрыПериодовСтажаПФР.Начало КАК Начало,
	|	ПараметрыПериодовСтажаПФР.Окончание КАК Окончание,
	|	ПараметрыПериодовСтажаПФР.Приоритет КАК Приоритет,
	|	ПараметрыПериодовСтажаПФР.Сторно КАК Сторно,
	|	ПараметрыПериодовСтажаПФР.ДокументОснование КАК ДокументОснование,
	|	ПараметрыПериодовСтажаПФР.ВидСтажаПФР КАК ВидСтажаПФР,
	|	ПараметрыПериодовСтажаПФР.Организация КАК Организация,
	|	ПараметрыПериодовСтажаПФР.Подразделение КАК Подразделение,
	|	ПараметрыПериодовСтажаПФР.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	ПараметрыПериодовСтажаПФР.ГрафикРаботы КАК ГрафикРаботы,
	|	ПараметрыПериодовСтажаПФР.Должность КАК Должность,
	|	ПараметрыПериодовСтажаПФР.КоличествоСтавок КАК КоличествоСтавок,
	|	ПараметрыПериодовСтажаПФР.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|	ПараметрыПериодовСтажаПФР.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
	|	ПараметрыПериодовСтажаПФР.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВидСтажаПФР КАК ИспользованиеРесурсаВидСтажаПФР,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОрганизация КАК ИспользованиеРесурсаОрганизация,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаПодразделение КАК ИспользованиеРесурсаПодразделение,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжностьПоШтатномуРасписанию КАК ИспользованиеРесурсаДолжностьПоШтатномуРасписанию,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжность КАК ИспользованиеРесурсаДолжность,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаГрафикРаботы КАК ИспользованиеРесурсаГрафикРаботы,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаКоличествоСтавок КАК ИспользованиеРесурсаКоличествоСтавок,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаТерриториальныеУсловия КАК ИспользованиеРесурсаТерриториальныеУсловия,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОсобыеУсловияТруда КАК ИспользованиеРесурсаОсобыеУсловияТруда,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОснованиеВыслугиЛет КАК ИспользованиеРесурсаОснованиеВыслугиЛет,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаТерритория КАК ИспользованиеРесурсаТерритория,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаУсловияТруда КАК ИспользованиеРесурсаУсловияТруда,
	|	ПараметрыПериодовСтажаПФР.Территория КАК Территория,
	|	ПараметрыПериодовСтажаПФР.УсловияТруда КАК УсловияТруда,
	|	ПараметрыПериодовСтажаПФР.Сотрудник КАК Сотрудник,
	|	ПараметрыПериодовСтажаПФР.ВнутреннееСовместительство КАК ВнутреннееСовместительство,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВнутреннееСовместительство КАК ИспользованиеРесурсаВнутреннееСовместительство,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаТерриториальныеУсловияДополнительные КАК ИспользованиеРесурсаТерриториальныеУсловияДополнительные,
	|	ПараметрыПериодовСтажаПФР.ТерриториальныеУсловияДополнительные КАК ТерриториальныеУсловияДополнительные
	|ПОМЕСТИТЬ ВТПредыдущиеДанныеРегистра
	|ИЗ
	|	РегистрСведений.ПараметрыПериодовСтажаПФР КАК ПараметрыПериодовСтажаПФР
	|ГДЕ
	|	ПараметрыПериодовСтажаПФР.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	

	Если Не ДополнительныеСвойства.Свойство("МенеджерВременныхТаблиц") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СравнениеСПредыдущимНабором.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СравнениеСПредыдущимНабором.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СравнениеСПредыдущимНабором.ТипДоговора КАК ТипДоговора,
	|	СравнениеСПредыдущимНабором.Начало КАК Начало,
	|	СравнениеСПредыдущимНабором.Окончание КАК Окончание,
	|	СравнениеСПредыдущимНабором.Приоритет КАК Приоритет,
	|	СравнениеСПредыдущимНабором.Сторно КАК Сторно,
	|	СравнениеСПредыдущимНабором.ДокументОснование КАК ДокументОснование,
	|	СравнениеСПредыдущимНабором.ВидСтажаПФР КАК ВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.Организация КАК Организация,
	|	СравнениеСПредыдущимНабором.Подразделение КАК Подразделение,
	|	СравнениеСПредыдущимНабором.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	СравнениеСПредыдущимНабором.ГрафикРаботы КАК ГрафикРаботы,
	|	СравнениеСПредыдущимНабором.Должность КАК Должность,
	|	СравнениеСПредыдущимНабором.КоличествоСтавок КАК КоличествоСтавок,
	|	СравнениеСПредыдущимНабором.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|	СравнениеСПредыдущимНабором.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
	|	СравнениеСПредыдущимНабором.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаВидСтажаПФР КАК ИспользованиеРесурсаВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОрганизация КАК ИспользованиеРесурсаОрганизация,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаПодразделение КАК ИспользованиеРесурсаПодразделение,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаДолжностьПоШтатномуРасписанию КАК ИспользованиеРесурсаДолжностьПоШтатномуРасписанию,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаДолжность КАК ИспользованиеРесурсаДолжность,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаГрафикРаботы КАК ИспользованиеРесурсаГрафикРаботы,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаКоличествоСтавок КАК ИспользованиеРесурсаКоличествоСтавок,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаТерриториальныеУсловия КАК ИспользованиеРесурсаТерриториальныеУсловия,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОсобыеУсловияТруда КАК ИспользованиеРесурсаОсобыеУсловияТруда,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОснованиеВыслугиЛет КАК ИспользованиеРесурсаОснованиеВыслугиЛет,
	|	СУММА(СравнениеСПредыдущимНабором.ФлагИзменений) КАК ФлагИзменений,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаТерритория КАК ИспользованиеРесурсаТерритория,
	|	СравнениеСПредыдущимНабором.УсловияТруда КАК УсловияТруда,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаУсловияТруда КАК ИспользованиеРесурсаУсловияТруда,
	|	СравнениеСПредыдущимНабором.Территория КАК Территория,
	|	СравнениеСПредыдущимНабором.Сотрудник КАК Сотрудник,
	|	СравнениеСПредыдущимНабором.ВнутреннееСовместительство КАК ВнутреннееСовместительство,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаВнутреннееСовместительство КАК ИспользованиеРесурсаВнутреннееСовместительство,
	|	СравнениеСПредыдущимНабором.ТерриториальныеУсловияДополнительные КАК ТерриториальныеУсловияДополнительные,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаТерриториальныеУсловияДополнительные КАК ИспользованиеРесурсаТерриториальныеУсловияДополнительные
	|ПОМЕСТИТЬ ВТИзменившиесяДанные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПредыдущиеДанныеРегистра.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		ПредыдущиеДанныеРегистра.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ПредыдущиеДанныеРегистра.ТипДоговора КАК ТипДоговора,
	|		ПредыдущиеДанныеРегистра.Начало КАК Начало,
	|		ПредыдущиеДанныеРегистра.Окончание КАК Окончание,
	|		ПредыдущиеДанныеРегистра.Приоритет КАК Приоритет,
	|		ПредыдущиеДанныеРегистра.Сторно КАК Сторно,
	|		ПредыдущиеДанныеРегистра.ДокументОснование КАК ДокументОснование,
	|		ПредыдущиеДанныеРегистра.ВидСтажаПФР КАК ВидСтажаПФР,
	|		ПредыдущиеДанныеРегистра.Организация КАК Организация,
	|		ПредыдущиеДанныеРегистра.Подразделение КАК Подразделение,
	|		ПредыдущиеДанныеРегистра.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|		ПредыдущиеДанныеРегистра.ГрафикРаботы КАК ГрафикРаботы,
	|		ПредыдущиеДанныеРегистра.Должность КАК Должность,
	|		ПредыдущиеДанныеРегистра.КоличествоСтавок КАК КоличествоСтавок,
	|		ПредыдущиеДанныеРегистра.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|		ПредыдущиеДанныеРегистра.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
	|		ПредыдущиеДанныеРегистра.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаВидСтажаПФР КАК ИспользованиеРесурсаВидСтажаПФР,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаОрганизация КАК ИспользованиеРесурсаОрганизация,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаПодразделение КАК ИспользованиеРесурсаПодразделение,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаДолжностьПоШтатномуРасписанию КАК ИспользованиеРесурсаДолжностьПоШтатномуРасписанию,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаДолжность КАК ИспользованиеРесурсаДолжность,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаГрафикРаботы КАК ИспользованиеРесурсаГрафикРаботы,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаКоличествоСтавок КАК ИспользованиеРесурсаКоличествоСтавок,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаТерриториальныеУсловия КАК ИспользованиеРесурсаТерриториальныеУсловия,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаОсобыеУсловияТруда КАК ИспользованиеРесурсаОсобыеУсловияТруда,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаОснованиеВыслугиЛет КАК ИспользованиеРесурсаОснованиеВыслугиЛет,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаТерритория КАК ИспользованиеРесурсаТерритория,
	|		ПредыдущиеДанныеРегистра.УсловияТруда КАК УсловияТруда,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаУсловияТруда КАК ИспользованиеРесурсаУсловияТруда,
	|		ПредыдущиеДанныеРегистра.Территория КАК Территория,
	|		ПредыдущиеДанныеРегистра.Сотрудник КАК Сотрудник,
	|		ПредыдущиеДанныеРегистра.ВнутреннееСовместительство КАК ВнутреннееСовместительство,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаВнутреннееСовместительство КАК ИспользованиеРесурсаВнутреннееСовместительство,
	|		ПредыдущиеДанныеРегистра.ТерриториальныеУсловияДополнительные КАК ТерриториальныеУсловияДополнительные,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаТерриториальныеУсловияДополнительные КАК ИспользованиеРесурсаТерриториальныеУсловияДополнительные,
	|		1 КАК ФлагИзменений
	|	ИЗ
	|		ВТПредыдущиеДанныеРегистра КАК ПредыдущиеДанныеРегистра
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПараметрыПериодовСтажаПФР.ГоловнаяОрганизация,
	|		ПараметрыПериодовСтажаПФР.ФизическоеЛицо,
	|		ПараметрыПериодовСтажаПФР.ТипДоговора,
	|		ПараметрыПериодовСтажаПФР.Начало,
	|		ПараметрыПериодовСтажаПФР.Окончание,
	|		ПараметрыПериодовСтажаПФР.Приоритет,
	|		ПараметрыПериодовСтажаПФР.Сторно,
	|		ПараметрыПериодовСтажаПФР.ДокументОснование,
	|		ПараметрыПериодовСтажаПФР.ВидСтажаПФР,
	|		ПараметрыПериодовСтажаПФР.Организация,
	|		ПараметрыПериодовСтажаПФР.Подразделение,
	|		ПараметрыПериодовСтажаПФР.ДолжностьПоШтатномуРасписанию,
	|		ПараметрыПериодовСтажаПФР.ГрафикРаботы,
	|		ПараметрыПериодовСтажаПФР.Должность,
	|		ПараметрыПериодовСтажаПФР.КоличествоСтавок,
	|		ПараметрыПериодовСтажаПФР.ТерриториальныеУсловия,
	|		ПараметрыПериодовСтажаПФР.ОсобыеУсловияТруда,
	|		ПараметрыПериодовСтажаПФР.ОснованиеВыслугиЛет,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВидСтажаПФР,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОрганизация,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаПодразделение,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжностьПоШтатномуРасписанию,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжность,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаГрафикРаботы,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаКоличествоСтавок,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаТерриториальныеУсловия,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОсобыеУсловияТруда,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОснованиеВыслугиЛет,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаТерритория,
	|		ПараметрыПериодовСтажаПФР.УсловияТруда,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаУсловияТруда,
	|		ПараметрыПериодовСтажаПФР.Территория,
	|		ПараметрыПериодовСтажаПФР.Сотрудник,
	|		ПараметрыПериодовСтажаПФР.ВнутреннееСовместительство,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВнутреннееСовместительство,
	|		ПараметрыПериодовСтажаПФР.ТерриториальныеУсловияДополнительные,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаТерриториальныеУсловияДополнительные,
	|		-1
	|	ИЗ
	|		РегистрСведений.ПараметрыПериодовСтажаПФР КАК ПараметрыПериодовСтажаПФР
	|	ГДЕ
	|		ПараметрыПериодовСтажаПФР.Регистратор = &Регистратор) КАК СравнениеСПредыдущимНабором
	|
	|СГРУППИРОВАТЬ ПО
	|	СравнениеСПредыдущимНабором.ФизическоеЛицо,
	|	СравнениеСПредыдущимНабором.ТипДоговора,
	|	СравнениеСПредыдущимНабором.Начало,
	|	СравнениеСПредыдущимНабором.Окончание,
	|	СравнениеСПредыдущимНабором.Приоритет,
	|	СравнениеСПредыдущимНабором.Сторно,
	|	СравнениеСПредыдущимНабором.ДокументОснование,
	|	СравнениеСПредыдущимНабором.ВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.Организация,
	|	СравнениеСПредыдущимНабором.Подразделение,
	|	СравнениеСПредыдущимНабором.ДолжностьПоШтатномуРасписанию,
	|	СравнениеСПредыдущимНабором.ГрафикРаботы,
	|	СравнениеСПредыдущимНабором.Должность,
	|	СравнениеСПредыдущимНабором.ТерриториальныеУсловия,
	|	СравнениеСПредыдущимНабором.ОсобыеУсловияТруда,
	|	СравнениеСПредыдущимНабором.ОснованиеВыслугиЛет,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОрганизация,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаПодразделение,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаДолжностьПоШтатномуРасписанию,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаДолжность,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаГрафикРаботы,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаКоличествоСтавок,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаТерриториальныеУсловия,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОсобыеУсловияТруда,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОснованиеВыслугиЛет,
	|	СравнениеСПредыдущимНабором.КоличествоСтавок,
	|	СравнениеСПредыдущимНабором.ГоловнаяОрганизация,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаТерритория,
	|	СравнениеСПредыдущимНабором.УсловияТруда,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаУсловияТруда,
	|	СравнениеСПредыдущимНабором.Территория,
	|	СравнениеСПредыдущимНабором.Сотрудник,
	|	СравнениеСПредыдущимНабором.ВнутреннееСовместительство,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаВнутреннееСовместительство,
	|	СравнениеСПредыдущимНабором.ТерриториальныеУсловияДополнительные,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаТерриториальныеУсловияДополнительные
	|
	|ИМЕЮЩИЕ
	|	СУММА(СравнениеСПредыдущимНабором.ФлагИзменений) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзменившиесяДанные.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ИзменившиесяДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ИзменившиесяДанные.Сотрудник КАК Сотрудник,
	|	ИзменившиесяДанные.ТипДоговора КАК ТипДоговора,
	|	ИзменившиесяДанные.Начало КАК Начало,
	|	ИзменившиесяДанные.Окончание КАК Окончание
	|ПОМЕСТИТЬ ВТКлючиИзменившихсяДанных
	|ИЗ
	|	ВТИзменившиесяДанные КАК ИзменившиесяДанные";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	Запрос.Выполнить();

	УчетСтажаПФР.ОбновитьДанныеВторичногоРегистра(Запрос.МенеджерВременныхТаблиц);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
